<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"staging","backend":"04f76316171f3d789504bc6f871ea1982d964047af57ae349b0d908001af3065","plan_job_ref":"Job Pull Request Checks #2983 at https://github.com/GSA-TTS/FAC/actions/runs/9043052925","plan_out_hash":"21fcd138b776e648acbf9cab6af96600df18c13fa2df68431f431130d7245a94","plan_hash":"a6a291d88d88307685005060c5d5e04e35bb72d4921f3d77c3b36457b189bf7c","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 8 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # module.staging.cloudfoundry_network_policy.scanner-network-policy will be created
+   resource "cloudfoundry_network_policy" "scanner-network-policy" {
+       id = (known after apply)

+       policy {
+           destination_app = "1c9e7877-3c69-4fe5-8541-7bca3f845eb1"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.staging.module.fac-file-scanner.cloudfoundry_app.scanner_app will be created
+   resource "cloudfoundry_app" "scanner_app" {
+       buildpack                       = "https://github.com/cloudfoundry/python-buildpack"
+       disk_quota                      = 512
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = (known after apply)
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "port"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 512
+       name                            = "fac-file-scanner"
+       path                            = "../shared/modules/scanner/scanner.zip"
+       ports                           = (known after apply)
+       space                           = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "rolling"
+       timeout                         = 180

+       routes {
+           port  = (known after apply)
+           route = (known after apply)
        }

+       service_binding {
+           service_instance = (known after apply)
        }
+       service_binding {
+           service_instance = "f43724f8-a94f-4ee9-9234-72aac309afad"
        }
+       service_binding {
+           service_instance = (known after apply)
        }
+       service_binding {
+           service_instance = "0f3f00c6-509d-4851-bfa0-df869c2b8321"
        }
    }

  # module.staging.module.fac-file-scanner.cloudfoundry_route.scanner_route will be created
+   resource "cloudfoundry_route" "scanner_route" {
+       domain   = "26df58ef-0c0d-4997-b68b-8defb7b3998b"
+       endpoint = (known after apply)
+       hostname = "fac-file-scanner-staging"
+       id       = (known after apply)
+       port     = (known after apply)
+       space    = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807"
    }

  # module.staging.module.fac-file-scanner.cloudfoundry_user_provided_service.clam will be created
+   resource "cloudfoundry_user_provided_service" "clam" {
+       credentials = (sensitive value)
+       id          = (known after apply)
+       name        = "clamav_ups"
+       space       = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807"
    }

  # module.staging.module.file_scanner_clamav.data.cloudfoundry_app.app will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_app" "app" {
+       buildpack                  = (known after apply)
+       command                    = (known after apply)
+       disk_quota                 = (known after apply)
+       enable_ssh                 = (known after apply)
+       environment                = (sensitive value)
+       health_check_http_endpoint = (known after apply)
+       health_check_timeout       = (known after apply)
+       health_check_type          = (known after apply)
+       id                         = (known after apply)
+       instances                  = (known after apply)
+       memory                     = (known after apply)
+       name                       = (known after apply)
+       name_or_id                 = "****************"
+       space                      = (known after apply)
+       stack                      = (known after apply)
+       state                      = (known after apply)
    }

  # module.staging.module.file_scanner_clamav.data.cloudfoundry_domain.internal will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "internal" {
+       domain   = (known after apply)
+       id       = (known after apply)
+       internal = (known after apply)
+       name     = "apps.internal"
+       org      = (known after apply)
    }

  # module.staging.module.file_scanner_clamav.data.cloudfoundry_space.space will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_space" "space" {
+       id       = (known after apply)
+       name     = "staging"
+       org      = (known after apply)
+       org_name = "gsa-tts-oros-fac"
+       quota    = (known after apply)
    }

  # module.staging.module.file_scanner_clamav.cloudfoundry_app.clamav_api will be created
+   resource "cloudfoundry_app" "clamav_api" {
+       buildpack                       = (known after apply)
+       disk_quota                      = 2048
+       docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:a6b645538b565528a5dba563be597d5d7c8fe162a4924b14048d50d117450cf8"
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = (known after apply)
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "port"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 3072
+       name                            = "fac-av-staging-fs"
+       ports                           = (known after apply)
+       space                           = (known after apply)
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "rolling"
+       timeout                         = 600

+       routes {
+           port  = (known after apply)
+           route = (known after apply)
        }
    }

  # module.staging.module.file_scanner_clamav.cloudfoundry_network_policy.clamav_routing will be created
+   resource "cloudfoundry_network_policy" "clamav_routing" {
+       id = (known after apply)

+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.staging.module.file_scanner_clamav.cloudfoundry_route.clamav_route will be created
+   resource "cloudfoundry_route" "clamav_route" {
+       domain   = (known after apply)
+       endpoint = (known after apply)
+       hostname = "fac-av-staging-fs"
+       id       = (known after apply)
+       port     = (known after apply)
+       space    = (known after apply)
    }

  # module.staging.module.fac-file-scanner.module.quarantine.cloudfoundry_service_instance.bucket will be created
+   resource "cloudfoundry_service_instance" "bucket" {
+       id                             = (known after apply)
+       name                           = "fac-file-scanner-quarantine"
+       replace_on_params_change       = false
+       replace_on_service_plan_change = false
+       service_plan                   = "021bb2a3-7e11-4fc2-b06b-d9f5938cd806"
+       space                          = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807"
+       tags                           = [
+           "s3",
        ]
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.staging.module.cg-logshipper.module.s3-logshipper-storage.cloudfoundry_service_instance.bucket,
  on /tmp/terraform-data-dir/modules/staging.cg-logshipper.s3-logshipper-storage/s3/main.tf line 14, in resource "cloudfoundry_service_instance" "bucket":
  14:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases

(and 4 more similar warnings elsewhere)
```
</details>

:memo: Plan generated in [Pull Request Checks #2983](https://github.com/GSA-TTS/FAC/actions/runs/9043052925)